note-spark_use.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-27 Sat 17:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>spark 学习</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a>
</div>
<div id="content">
<h1 class="title">spark 学习</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfce02b6">what is spark</a></li>
<li><a href="#org4ba5a96">RDD</a>
<ul>
<li><a href="#org4d32541">RDD基础</a></li>
</ul>
</li>
<li><a href="#orgc4aee00">spark use</a>
<ul>
<li><a href="#orgb8db991">spark base</a></li>
<li><a href="#orgeea4a43">spark install</a></li>
<li><a href="#org97c587a">spark shell</a></li>
<li><a href="#org3fa4def">idea spark scala</a></li>
<li><a href="#org262dcc5">idea spark java</a></li>
<li><a href="#org840d915">rdd &amp; dataframe</a></li>
</ul>
</li>
<li><a href="#orgec7a6db">docker spark</a>
<ul>
<li><a href="#orgea46c6b">docker for mac install spark 2.2.0 + hadoop 2.8.0</a></li>
<li><a href="#orgc1b4990">docker search spark</a></li>
</ul>
</li>
<li><a href="#org29613e1">docker hbase</a></li>
</ul>
</div>
</div>
<p>
Spark快速大数据分析[美] 卡劳（Holden Karau）
</p>
<div id="outline-container-orgfce02b6" class="outline-2">
<h2 id="orgfce02b6">what is spark</h2>
<div class="outline-text-2" id="text-orgfce02b6">
<p>
spark 是一个用来实现快速而通用的集群计算的平台
</p>
<ul class="org-ul">
<li>spark core</li>
<li>spark sql</li>
<li>spark streaming</li>
<li>MLlib</li>
<li>GraphX</li>
<li>集群管理器
<ul class="org-ul">
<li>自带简易调度器，独立调度器</li>
<li>Hadoop YARN</li>
<li>Apache Mesos</li>
</ul></li>
<li>Spark的存储层次
<ul class="org-ul">
<li>支持本地文件,HDFS,Hive,HBase</li>
<li>文件格式:文本文件,SequenceFile,Avro,Parquet</li>
</ul></li>
<li>shell
spark shell 可用来与分布式存储在许多机器的内存或者硬盘上的数据进行交互
python shell / scala shell</li>
<li>SparkContext
每个Sparkyingy</li>
</ul>
</div>
</div>
<div id="outline-container-org4ba5a96" class="outline-2">
<h2 id="org4ba5a96">RDD</h2>
<div class="outline-text-2" id="text-org4ba5a96">
<p>
RDD(resilient distributed dataset)
</p>
</div>
<div id="outline-container-org4d32541" class="outline-3">
<h3 id="org4d32541">RDD基础</h3>
<div class="outline-text-3" id="text-org4d32541">
<p>
Spark中的RDD是一个不可变的分布式对象集合
</p>
</div>
</div>
</div>

<div id="outline-container-orgc4aee00" class="outline-2">
<h2 id="orgc4aee00">spark use</h2>
<div class="outline-text-2" id="text-orgc4aee00">
</div>
<div id="outline-container-orgb8db991" class="outline-3">
<h3 id="orgb8db991">spark base</h3>
<div class="outline-text-3" id="text-orgb8db991">
<p>
rdd(resilient distributed dataset)
</p>
</div>
</div>
<div id="outline-container-orgeea4a43" class="outline-3">
<h3 id="orgeea4a43">spark install</h3>
<div class="outline-text-3" id="text-orgeea4a43">
<p>
函数式编程
shell下执行:paste
</p>
</div>
</div>
<div id="outline-container-org97c587a" class="outline-3">
<h3 id="org97c587a">spark shell</h3>
<div class="outline-text-3" id="text-org97c587a">
<p>
bin/spark-shell
</p>
<ul class="org-ul">
<li>创建RDD
sc.parallelize()</li>
<li>RDD操作
<ul class="org-ul">
<li>转化操作
返回的是RDD
map()
filter()</li>
<li>行动操作
返回结果或把结果写入外部系统的操作,返回的是其他数据类型</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org3fa4def" class="outline-3">
<h3 id="org3fa4def">idea spark scala</h3>
<div class="outline-text-3" id="text-org3fa4def">
<p>
scala 项目手动打包
删除scala 和spark的包
</p>

<p>
执行中 spark-submit &#x2013;class com.nti.spark.SparkTags spark_scala_jar.jar
</p>

<p>
sbt 构建项目 需要等待sbt版本下载好才会生成src目录
</p>
</div>
</div>

<div id="outline-container-org262dcc5" class="outline-3">
<h3 id="org262dcc5">idea spark java</h3>
<div class="outline-text-3" id="text-org262dcc5">
<ol class="org-ol">
<li>jre 1.5 换成1.8</li>
</ol>
</div>
</div>
<div id="outline-container-org840d915" class="outline-3">
<h3 id="org840d915">rdd &amp; dataframe</h3>
</div>
</div>
<div id="outline-container-orgec7a6db" class="outline-2">
<h2 id="orgec7a6db">docker spark</h2>
<div class="outline-text-2" id="text-orgec7a6db">
</div>
<div id="outline-container-orgea46c6b" class="outline-3">
<h3 id="orgea46c6b">docker for mac install spark 2.2.0 + hadoop 2.8.0</h3>
<div class="outline-text-3" id="text-orgea46c6b">
<p>
refer : <a href="http://blog.csdn.net/gogo_yao/article/details/76863201">http://blog.csdn.net/gogo_yao/article/details/76863201</a>
</p>

<ol class="org-ol">
<li>启动容器
docker run &#x2013;name centos-6 -tid centos:6 /bin/bash</li>
<li>复制安装包到centos容器
docker cp scala-2.12.3.tgz 23288ad95817:/
docker cp jdk-8u144-linux-x64.rpm 23288ad95817:/
docker cp spark-2.2.0-bin-without-hadoop.tgz 23288ad95817:/
docker cp hadoop-2.8.0.tar.gz 23288ad95817:/root/.local</li>
<li>进入容器
docker exec -it 23288ad9581 /bin/bash
hadoop spark install</li>
<li><p>
保存镜像
docker commit -m "centos-6 with spark 2.2.0 and hadoop 2.8.0" 23288ad95817 centos:with-saprk-hadoop
</p>

<p>
REPOSITORY          TAG                 IMAGE ID            CREATED             SIZE
centos              with-saprk-hadoop   30333b7011ce        20 seconds ago      3.84GB
</p></li>
<li><p>
使用保存的镜像搭建集群
</p>

<p>
#端口50070和8088，8080是用来在浏览器中访问hadoop、yarn、spark的WEB界面，这里分别映射到物理机的50070和8088，8080端口。
docker run -itd -P -p 50070:50070 -p 8088:8088 -p 8080:8080 &#x2013;name master -h master &#x2013;add-host slave01:172.17.0.4 &#x2013;add-host slave02:172.17.0.5 centos:with-saprk-hadoop
docker run -itd -P &#x2013;name slave01 -h slave01 &#x2013;add-host master:172.17.0.3 &#x2013;add-host slave02:172.17.0.5  centos:with-saprk-hadoop
docker run -itd -P &#x2013;name slave02 -h slave02 &#x2013;add-host master:172.17.0.3 &#x2013;add-host slave01:172.17.0.4  centos:with-saprk-hadoop
</p></li>
<li><p>
进入集群管理
docker exec -it master /bin/bash
</p>

<p>
service sshd restart
</p>

<p>
cd <i>root</i>.local/hadoop-2.8.0/sbin;sh start-all.sh   
cd <i>root</i>.local/spark-2.2.0-bin-without-hadoop/sbin; sh start-all.sh
</p></li>
</ol>
</div>
</div>
<div id="outline-container-orgc1b4990" class="outline-3">
<h3 id="orgc1b4990">docker search spark</h3>
<div class="outline-text-3" id="text-orgc1b4990">
<p>
docker pull sequenceiq/spark:1.6.0
</p>
</div>
</div>
</div>
<div id="outline-container-org29613e1" class="outline-2">
<h2 id="org29613e1">docker hbase</h2>
</div>
</div>
</body>
</html>